###################################################################

# Created by write_sdc on Sun Apr 28 02:16:10 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports clka]
set_driving_cell -lib_cell INVX1 [get_ports clkb]
set_driving_cell -lib_cell INVX1 [get_ports restart]
set_driving_cell -lib_cell INVX1 [get_ports new_game]
set_driving_cell -lib_cell INVX1 [get_ports set_board_flag]
set_driving_cell -lib_cell INVX1 [get_ports set_diff_flag]
set_driving_cell -lib_cell INVX1 [get_ports row_flag]
set_driving_cell -lib_cell INVX1 [get_ports col_flag]
set_driving_cell -lib_cell INVX1 [get_ports val_flag]
set_driving_cell -lib_cell INVX1 [get_ports check_flag]
set_driving_cell -lib_cell INVX1 [get_ports {rand_setup[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {rand_setup[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {rand_setup[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {rand_setup[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {rand_A[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {rand_A[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {rand_A[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {rand_A[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {rand_B[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {rand_B[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {rand_B[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {rand_B[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {diff_cell_val[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {diff_cell_val[0]}]
create_clock -name vclk  -period 50  -waveform {0 25}
set_input_delay -clock vclk  1  [get_ports clka]
set_input_delay -clock vclk  1  [get_ports clkb]
set_input_delay -clock vclk  1  [get_ports restart]
set_input_delay -clock vclk  1  [get_ports new_game]
set_input_delay -clock vclk  1  [get_ports set_board_flag]
set_input_delay -clock vclk  1  [get_ports set_diff_flag]
set_input_delay -clock vclk  1  [get_ports row_flag]
set_input_delay -clock vclk  1  [get_ports col_flag]
set_input_delay -clock vclk  1  [get_ports val_flag]
set_input_delay -clock vclk  1  [get_ports check_flag]
set_input_delay -clock vclk  1  [get_ports {rand_setup[3]}]
set_input_delay -clock vclk  1  [get_ports {rand_setup[2]}]
set_input_delay -clock vclk  1  [get_ports {rand_setup[1]}]
set_input_delay -clock vclk  1  [get_ports {rand_setup[0]}]
set_input_delay -clock vclk  1  [get_ports {rand_A[3]}]
set_input_delay -clock vclk  1  [get_ports {rand_A[2]}]
set_input_delay -clock vclk  1  [get_ports {rand_A[1]}]
set_input_delay -clock vclk  1  [get_ports {rand_A[0]}]
set_input_delay -clock vclk  1  [get_ports {rand_B[3]}]
set_input_delay -clock vclk  1  [get_ports {rand_B[2]}]
set_input_delay -clock vclk  1  [get_ports {rand_B[1]}]
set_input_delay -clock vclk  1  [get_ports {rand_B[0]}]
set_input_delay -clock vclk  1  [get_ports {diff_cell_val[1]}]
set_input_delay -clock vclk  1  [get_ports {diff_cell_val[0]}]
set_output_delay -clock vclk  1  [get_ports solved]
set_output_delay -clock vclk  1  [get_ports {fill_flag[15]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[14]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[13]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[12]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[11]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[10]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[9]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[8]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[7]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[6]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[5]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[4]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[3]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[2]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[1]}]
set_output_delay -clock vclk  1  [get_ports {fill_flag[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_0[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_0[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_0[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_1[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_1[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_1[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_2[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_2[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_2[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_3[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_3[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_3[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_4[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_4[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_4[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_5[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_5[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_5[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_6[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_6[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_6[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_7[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_7[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_7[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_8[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_8[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_8[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_9[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_9[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_9[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_10[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_10[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_10[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_11[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_11[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_11[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_12[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_12[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_12[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_13[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_13[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_13[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_14[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_14[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_14[0]}]
set_output_delay -clock vclk  1  [get_ports {user_board_15[2]}]
set_output_delay -clock vclk  1  [get_ports {user_board_15[1]}]
set_output_delay -clock vclk  1  [get_ports {user_board_15[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_0[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_0[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_0[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_1[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_1[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_1[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_2[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_2[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_2[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_3[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_3[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_3[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_4[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_4[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_4[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_5[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_5[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_5[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_6[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_6[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_6[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_7[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_7[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_7[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_8[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_8[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_8[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_9[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_9[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_9[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_10[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_10[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_10[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_11[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_11[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_11[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_12[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_12[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_12[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_13[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_13[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_13[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_14[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_14[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_14[0]}]
set_output_delay -clock vclk  1  [get_ports {real_board_15[2]}]
set_output_delay -clock vclk  1  [get_ports {real_board_15[1]}]
set_output_delay -clock vclk  1  [get_ports {real_board_15[0]}]
